# Aggregation queries

In this assigment, we will fetch data from a relational database server directly into Python variables. Using these new skills, we will complete the problems from Chapters 12, 13, and 14 in *SQL Queries for Mere Mortals*.

## Concepts

Review the MySQL aggregate functions: https://dev.mysql.com/doc/refman/8.0/en/aggregate-functions.html

Three types of queries

1. Aggregation functions with no `GROUP BY` clause produce 1 row. 
2. Aggregation functions combined with a `GROUP BY` clause. The unique key of the result is composed of the columns of the `GROUP BY` clause.
3. Most common pattern: `JOIN` or `LEFT JOIN` of a table pair in a one-to-many relationship, grouped by the primary key of the left table. This aggregates the right entity set with respect to the left entity set. 

Note that MySQL with the default settings allows mixing aggregated and non-aggregated values (See https://dev.mysql.com/doc/refman/5.7/en/sql-mode.html#sqlmode_only_full_group_by). So you have to watch avoid invalid mixes of values.

Using `HAVING` is equivalent to using a `WHERE` clause in an outer query.

# Aggregation Queries

Queries using aggregation functions, `GROUP BY`, and `HAVING` clauses. Using `LEFT JOIN` in combination with `GROUP BY`

In [1]:
import json
import pymysql 

pymysql.install_as_MySQLdb()

with open('cred.json') as f:
    creds = json.load(f)

connection_string = "mysql://{user}:{password}@{host}".format(**creds)

%load_ext sql
%config SqlMagic.autocommit=True
%sql $connection_string

In [2]:
import datajoint as dj
sales = dj.create_virtual_module('sales', 'shared_sales')
dj.Diagram(sales)

[2022-10-11 19:33:24,477][INFO]: Connecting dimitri@db.ust-data-sci.net:3306
[2022-10-11 19:33:24,827][INFO]: Connected dimitri@db.ust-data-sci.net:3306

### Increasing complexity of queries

In [3]:
%%sql

USE shared_sales

 * mysql://dimitri:***@db.ust-data-sci.net
0 rows affected.

[]

## Aggregation functions MAX, MIN, AVG, SUM, COUNT

In [4]:
%%sql

SELECT *
FROM product 
LIMIT 10;

 * mysql://dimitri:***@db.ust-data-sci.net
10 rows affected.

[(1, 'Trek 9000 Mountain Bike', '', Decimal('1200.00'), 6, 2),
 (2, 'Eagle FS-3 Mountain Bike', '', Decimal('1800.00'), 8, 2),
 (3, 'Dog Ear Cyclecomputer', '', Decimal('75.00'), 20, 1),
 (4, 'Victoria Pro All Weather Tires', '', Decimal('54.95'), 20, 4),
 (5, 'Dog Ear Helmet Mount Mirrors', '', Decimal('7.45'), 12, 1),
 (6, 'Viscount Mountain Bike', '', Decimal('635.00'), 5, 2),
 (7, 'Viscount C-500 Wireless Bike Computer', '', Decimal('49.00'), 30, 1),
 (8, 'Kryptonite Advanced 2000 U-Lock', '', Decimal('50.00'), 20, 1),
 (9, 'Nikoma Lok-Tight U-Lock', '', Decimal('33.00'), 12, 1),
 (10, 'Viscount Microshell Helmet', '', Decimal('36.00'), 20, 1)]

In [5]:
%%sql
-- show the max retail price and the average retail price of products

SELECT COUNT(*) AS n, MAX(retail_price) max_price, 
    AVG(retail_price) avg_price 
FROM product

 * mysql://dimitri:***@db.ust-data-sci.net
1 rows affected.

[(40, Decimal('1800.00'), Decimal('196.033500'))]

In [6]:
%%sql

SELECT count(*) n,
MAX(retail_price) max_price, 
AVG(retail_price) avg_price 
FROM product

 * mysql://dimitri:***@db.ust-data-sci.net
1 rows affected.

[(40, Decimal('1800.00'), Decimal('196.033500'))]

In [7]:
%%sql

-- aggregation with condition

SELECT AVG(retail_price) as avg_price 
FROM product 
WHERE category_id NOT IN (
    SELECT category_id 
    FROM category
    WHERE category_description = "Bikes")

 * mysql://dimitri:***@db.ust-data-sci.net
1 rows affected.

[(Decimal('71.009444'),)]

In [8]:
%%sql
-- show products above average price
-- The following does NOT work

SELECT * 
FROM product 
WHERE retail_price > avg(retail_price)

 * mysql://dimitri:***@db.ust-data-sci.net
(pymysql.err.ProgrammingError) (1111, 'Invalid use of group function')
[SQL: -- show products above average price
-- The following does NOT work

SELECT *
FROM product
WHERE retail_price > avg(retail_price)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [9]:
%%sql
-- show products above average price
-- Use a scalar subquery

SELECT * 
FROM product 
WHERE retail_price > (SELECT avg(retail_price) FROM product)

 * mysql://dimitri:***@db.ust-data-sci.net
4 rows affected.

[(1, 'Trek 9000 Mountain Bike', '', Decimal('1200.00'), 6, 2),
 (2, 'Eagle FS-3 Mountain Bike', '', Decimal('1800.00'), 8, 2),
 (6, 'Viscount Mountain Bike', '', Decimal('635.00'), 5, 2),
 (11, 'GT RTS-2 Mountain Bike', '', Decimal('1650.00'), 5, 2)]

In [10]:
%%sql

-- what not to do:

SELECT *
FROM product
GROUP BY category_id

 * mysql://dimitri:***@db.ust-data-sci.net
6 rows affected.

[(3, 'Dog Ear Cyclecomputer', '', Decimal('75.00'), 20, 1),
 (1, 'Trek 9000 Mountain Bike', '', Decimal('1200.00'), 6, 2),
 (23, 'Ultra-Pro Rain Jacket', '', Decimal('85.00'), 30, 3),
 (4, 'Victoria Pro All Weather Tires', '', Decimal('54.95'), 20, 4),
 (39, 'Road Warrior Hitch Pack', '', Decimal('175.00'), 6, 5),
 (27, 'X-Pro All Weather Tires', '', Decimal('24.00'), 20, 6)]

In [11]:
%%sql

-- this is good

SELECT category_id
FROM product
GROUP BY category_id

 * mysql://dimitri:***@db.ust-data-sci.net
6 rows affected.

[(1,), (2,), (3,), (4,), (5,), (6,)]

In [12]:
%%sql

SELECT DISTINCT category_id
FROM product

 * mysql://dimitri:***@db.ust-data-sci.net
6 rows affected.

[(1,), (2,), (3,), (4,), (5,), (6,)]

In [13]:
%%sql

SELECT category_id, 
   count(*) as n, 
   ROUND(AVG(retail_price), 2) as avg_price
FROM product
GROUP BY category_id

 * mysql://dimitri:***@db.ust-data-sci.net
6 rows affected.

[(1, 18, Decimal('66.19')),
 (2, 4, Decimal('1321.25')),
 (3, 4, Decimal('51.25')),
 (4, 9, Decimal('79.77')),
 (5, 2, Decimal('177.50')),
 (6, 3, Decimal('29.00'))]

In [14]:
%%sql 

-- using in a subquery

SELECT * FROM (
    SELECT category_id, round(AVG(retail_price), 2) as avg_price
    FROM product
    GROUP BY category_id) as _ NATURAL JOIN category

 * mysql://dimitri:***@db.ust-data-sci.net
6 rows affected.

[(1, Decimal('66.19'), 'Accessories'),
 (2, Decimal('1321.25'), 'Bikes'),
 (3, Decimal('51.25'), 'Clothing'),
 (4, Decimal('79.77'), 'Components'),
 (5, Decimal('177.50'), 'Car racks'),
 (6, Decimal('29.00'), 'Tires')]

In [15]:
%%sql 

-- pre-join before group

SELECT category_id, category_description, avg(retail_price) as avg_price 
FROM category NATURAL LEFT JOIN product
GROUP BY category_id

 * mysql://dimitri:***@db.ust-data-sci.net
6 rows affected.

[(1, 'Accessories', Decimal('66.191667')),
 (2, 'Bikes', Decimal('1321.250000')),
 (3, 'Clothing', Decimal('51.250000')),
 (4, 'Components', Decimal('79.765556')),
 (5, 'Car racks', Decimal('177.500000')),
 (6, 'Tires', Decimal('29.000000'))]

In [16]:
%%sql

-- show number of products in each  category with retail price > 100.00

SELECT category.*, count(*) as n
FROM category NATURAL LEFT JOIN product 
WHERE retail_price > 100
GROUP BY category_id

 * mysql://dimitri:***@db.ust-data-sci.net
4 rows affected.

[(1, 'Accessories', 4),
 (2, 'Bikes', 4),
 (4, 'Components', 3),
 (5, 'Car racks', 2)]

In [17]:
%%sql 

SELECT category.*, count(product_number) as number_of_products
FROM category NATURAL LEFT JOIN (
    SELECT * FROM product WHERE retail_price > 100) as _
GROUP BY category_id

 * mysql://dimitri:***@db.ust-data-sci.net
6 rows affected.

[(1, 'Accessories', 4),
 (2, 'Bikes', 4),
 (3, 'Clothing', 0),
 (4, 'Components', 3),
 (5, 'Car racks', 2),
 (6, 'Tires', 0)]

In [18]:
%%sql

-- show the number of orders placed by each customer

SELECT customer_id, count(order_number) as number_of_orders
FROM customer NATURAL LEFT JOIN `order` 
GROUP BY customer_id

 * mysql://dimitri:***@db.ust-data-sci.net
28 rows affected.

[(1001, 44),
 (1002, 40),
 (1003, 35),
 (1004, 39),
 (1005, 40),
 (1006, 27),
 (1007, 36),
 (1008, 31),
 (1009, 37),
 (1010, 32),
 (1011, 33),
 (1012, 39),
 (1013, 36),
 (1014, 41),
 (1015, 29),
 (1016, 38),
 (1017, 44),
 (1018, 26),
 (1019, 23),
 (1020, 37),
 (1021, 42),
 (1022, 20),
 (1023, 25),
 (1024, 41),
 (1025, 41),
 (1026, 35),
 (1027, 33),
 (1028, 0)]

In [19]:
%%sql

-- show all customers who have placed over 40 orders since the start of 2016

SELECT * FROM (
    SELECT customer_id, count(order_number) as number_of_orders
    FROM customer NATURAL LEFT JOIN `order` 
    WHERE order_date > "2016-01-01"
    GROUP BY customer_id) as _
WHERE number_of_orders > 40

 * mysql://dimitri:***@db.ust-data-sci.net
6 rows affected.

[(1001, 44), (1014, 41), (1017, 44), (1021, 42), (1024, 41), (1025, 41)]

In [20]:
%%sql

-- show all customers who have placed over 40 orders since the start of 2016

SELECT customer_id, count(order_number) as number_of_orders
FROM customer NATURAL LEFT JOIN `order` 
WHERE order_date > "2016-01-01"
GROUP BY customer_id
HAVING number_of_orders > 40
ORDER BY number_of_orders DESC

 * mysql://dimitri:***@db.ust-data-sci.net
6 rows affected.

[(1001, 44), (1017, 44), (1021, 42), (1024, 41), (1025, 41), (1014, 41)]

In [21]:
%%sql

-- show the customer who has spent the most money

SELECT customer.*, sum(quoted_price * quantity_ordered) as total
FROM customer NATURAL LEFT JOIN 
   (SELECT * FROM `order` NATURAL JOIN `order__item`) as _
GROUP BY customer_id
ORDER BY total DESC
LIMIT 1

 * mysql://dimitri:***@db.ust-data-sci.net
1 rows affected.

[(1012, 'Liz', 'Keyser', '13920 S.E. 40th Street', 'Bellevue', 'WA', '98006', 425, '555-2556', Decimal('262174.17'))]

In [22]:
%%sql

-- show averages prices per category for products with 
-- retail price > 100.00

SELECT category.*, AVG(retail_price) as avg_price 
FROM category NATURAL JOIN product
WHERE retail_price > 100
GROUP BY category_id

 * mysql://dimitri:***@db.ust-data-sci.net
4 rows affected.

[(1, 'Accessories', Decimal('152.250000')),
 (2, 'Bikes', Decimal('1321.250000')),
 (4, 'Components', Decimal('164.650000')),
 (5, 'Car racks', Decimal('177.500000'))]

In [23]:
%%sql

-- Categories with the average prices > 100

SELECT * FROM (
    SELECT category.*, AVG(retail_price) as avg_price 
    FROM category NATURAL JOIN product
    GROUP BY category_id) as q
WHERE avg_price > 100

 * mysql://dimitri:***@db.ust-data-sci.net
2 rows affected.

[(2, 'Bikes', Decimal('1321.250000')), (5, 'Car racks', Decimal('177.500000'))]

In [24]:
%%sql

-- Categories with the average prices > 100

SELECT category.*, AVG(retail_price) as avg_price 
FROM category NATURAL JOIN product
GROUP BY category_id
HAVING avg_price > 100

 * mysql://dimitri:***@db.ust-data-sci.net
2 rows affected.

[(2, 'Bikes', Decimal('1321.250000')), (5, 'Car racks', Decimal('177.500000'))]

In [25]:
%%sql

select * from Products
WHERE RetailPrice > 100

 * mysql://dimitri:***@db.ust-data-sci.net
(pymysql.err.ProgrammingError) (1146, "Table 'shared_sales.Products' doesn't exist")
[SQL: select * from Products
WHERE RetailPrice > 100]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [26]:
%%sql
-- show empty orders 

SELECT * 
FROM Orders 
WHERE OrderNumber NOT IN (
    SELECT OrderNumber 
    FROM Order_Details)

 * mysql://dimitri:***@db.ust-data-sci.net
(pymysql.err.ProgrammingError) (1146, "Table 'shared_sales.Orders' doesn't exist")
[SQL: -- show empty orders

SELECT *
FROM Orders
WHERE OrderNumber NOT IN (
    SELECT OrderNumber
    FROM Order_Details)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [27]:
%%sql
-- show empty orders

SELECT Orders.* 
FROM Orders NATURAL LEFT JOIN Order_Details 
WHERE ProductNumber IS NULL

 * mysql://dimitri:***@db.ust-data-sci.net
(pymysql.err.ProgrammingError) (1146, "Table 'shared_sales.Orders' doesn't exist")
[SQL: -- show empty orders

SELECT Orders.*
FROM Orders NATURAL LEFT JOIN Order_Details
WHERE ProductNumber IS NULL]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [28]:
%%sql

-- bad because mixes aggregated and random 

SELECT * FROM Orders  NATURAL LEFT JOIN Order_Details
GROUP BY OrderNumber

 * mysql://dimitri:***@db.ust-data-sci.net
(pymysql.err.ProgrammingError) (1146, "Table 'shared_sales.Orders' doesn't exist")
[SQL: -- bad because mixes aggregated and random

SELECT * FROM Orders  NATURAL LEFT JOIN Order_Details
GROUP BY OrderNumber]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [29]:
%%sql

-- show empty orders

SELECT orders.*, COUNT(ProductNumber) as nitems 
FROM Orders NATURAL LEFT JOIN Order_Details
GROUP BY OrderNumber
HAVING nitems=0

 * mysql://dimitri:***@db.ust-data-sci.net
(pymysql.err.ProgrammingError) (1146, "Table 'shared_sales.Orders' doesn't exist")
[SQL: -- show empty orders

SELECT Orders.*, COUNT(ProductNumber) as nitems
FROM Orders NATURAL LEFT JOIN Order_Details
GROUP BY OrderNumber
HAVING nitems=0]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [30]:
%%sql

SELECT orders.*, ProductNumber as nitems FROM orders  NATURAL LEFT JOIN order_details

 * mysql://dimitri:***@db.ust-data-sci.net
(pymysql.err.ProgrammingError) (1146, "Table 'shared_sales.orders' doesn't exist")
[SQL: SELECT orders.*, ProductNumber as nitems FROM orders  NATURAL LEFT JOIN order_details]
(Background on this error at: https://sqlalche.me/e/14/f405)

## Example problems

In [31]:
%%sql

-- Customers and the number of orders that they made

SELECT CustomerID, CustFirstName, CustLastName, count(OrderNumber) as norders
FROM Customers NATURAL LEFT JOIN Orders
GROUP BY CustomerID
ORDER BY norders

 * mysql://dimitri:***@db.ust-data-sci.net
(pymysql.err.ProgrammingError) (1146, "Table 'shared_sales.Customers' doesn't exist")
[SQL: -- Customers and the number of orders that they made

SELECT CustomerID, CustFirstName, CustLastName, count(OrderNumber) as norders
FROM Customers NATURAL LEFT JOIN Orders
GROUP BY CustomerID
ORDER BY norders]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [ ]:
%%sql

-- orders with their total amounts

SELECT OrderNumber, OrderDate, IFNULL(sum(QuotedPrice * QuantityOrdered), 0) as total_amount
FROM Orders NATURAL LEFT JOIN Order_Details 
GROUP BY OrderNumber
ORDER BY total_amount

In [ ]:
%%sql

-- customers and the total $$$ spent

SELECT CustomerID, CustLastName, sum(total_amount) money_spent
FROM customers NATURAL LEFT JOIN (
    SELECT CustomerID, IFNULL(sum(QuotedPrice * QuantityOrdered), 0) as total_amount
    FROM Orders NATURAL LEFT JOIN Order_Details 
    GROUP BY OrderNumber) as q
GROUP BY CustomerID
ORDER BY money_spent DESC

In [ ]:
%%sql

-- customers and the total $$$ spent

SELECT CustomerID, CustLastName, IFNULL(sum(QuotedPrice * QuantityOrdered), 0) money_spent
FROM Customers NATURAL LEFT JOIN (SELECT * FROM Orders NATURAL JOIN Order_Details) as q
GROUP BY CustomerID
ORDER BY money_spent DESC

# Summary of principles 
1. Without a `GROUP BY`, aggregation functions collapse the table into a single row.
2. With `GROUP BY`, the grouping attributes become the new primary key of the result.  
3. Do not mix aggregated and non-aggregated values in the result with or without a `GROUP BY`.
4. `HAVING` plays the same role as the `WHERE` clause in a nesting outer query so it can use the output of the aggregation functions.
5. `LEFT JOIN` is often follwed with a `GROUP BY` by the primary key attributes of the left table. In this scenario the entities in the right table are aggregated for each matching row in the left table.

### Chapter 12 (total aggregation -- no grouping)

In [ ]:
Problem 1. 
“How many customers do we have in the state of California?”

Viescas, John L.. SQL Queries for Mere Mortals (p. 460). Pearson Education. Kindle Edition.

In [ ]:
“What is the average retail price of a mountain bike?” 

Viescas, John L.. SQL Queries for Mere Mortals (p. 467). Pearson Education. Kindle Edition.

In [ ]:
“What was the date of our most recent order?”

Viescas, John L.. SQL Queries for Mere Mortals (p. 467). Pearson Education. Kindle Edition.

In [ ]:
%%sql 
SELECT OrderNumber, OrderDate as latest_Order
FROM Orders
Order By latest_order DESC
LIMIT 1

In [ ]:
%%sql
SELECT max(OrderDate) as last_date 
FROM Orders

In [ ]:
%%sql
-- Where was the Last order to a customer in California

SELECT max(OrderDate) as last_date
FROM Orders
WHERE CustomerID in (SELECT CustomerID FROM Customers WHERE CustState="TX")

### Chapter 13 (aggregation with grouping)

In [ ]:
“Display for each product the product name and the total sales.”

Viescas, John L.. SQL Queries for Mere Mortals (p. 490). Pearson Education. Kindle Edition.

### Chapter 14 (aggregation with grouping and filtering with HAVING)

In [ ]:
“Show me the subject categories that have fewer than three full professors teaching that subject.”

Viescas, John L.. SQL Queries for Mere Mortals (p. 513). Pearson Education. Kindle Edition.

In [ ]:
%%sql
use shared_school

In [ ]:
%%sql

SELECT Categories.*, count(StaffID) as n 
   FROM Categories NATURAL LEFT JOIN (
       SELECT * FROM Faculty_Categories NATURAL JOIN Faculty WHERE Title="Professor") as q
   GROUP BY CategoryID
   HAVING n < 3

In [ ]:
“How many orders are for only one product?”

Viescas, John L.. SQL Queries for Mere Mortals (p. 528). Pearson Education. Kindle Edition.

In [ ]:
%%sql
use shared_sales

In [ ]:
%%sql

SELECT count(*) FROM (
    SELECT Orders.*, count(ProductNumber) as n
       FROM Orders NATURAL LEFT JOIN Order_Details
        GROUP BY OrderNumber
        HAVING n=1) as q

In [ ]:
%%sql

# Homework --- Due Nov 12

## Chapter 12

**Problem 1 (Sales):** Show the total amount of order number 8.
    
    Answer $1492.60

**Problem 2 (School):** List the most senior staff members (earliest hired).
    
    Answer 1 row.

## Chapter 13

**Problem 3 (Sales):** List vendors along with the average number of days they take to deliver the order.
    
    Answer 10 rows.

**Problem 4 (Sales):** List vendors along with the number of products each sells.
    
    Answer 10 rows.

**Problem 5 (School):** List staff members and the number of classes each is scheduled to teach.
    
    Answer 27 rows.

## Chapter 14

**Problem 6 (Sales):** Count the orders that only have one product
    
    1 row

**Problem 7 (School):**  List staff members that teach fewer than three classes
    
    7 rows

**Problem 8 (Recipes):** List recipes that use more than three teaspoons of salt.
    
    1 row

# Aggregations in Datajoint

In [ ]:
import datajoint as dj

In [ ]:
schema = dj.Schema('shared_sales')
schema.spawn_missing_classes()

In [ ]:
dj.Diagram(schema)

In [ ]:
Customer.aggr(Order, n='count(order_number)', 
              duration='datediff(max(order_date), min(order_date))') & 'n>30'

In [ ]:
# show total amount spent by customer

Customer.aggr(Order * Order.Item, 
              spent='sum(quantity_ordered * quoted_price)')

In [ ]:
Order.Item()

In [ ]:
dj.U('customer_state').aggr(Customer, n='count(customer_id)')

In [ ]:
Customer()